{
  "very_simple": [
    "What's 2 + 2?",
    "What color is the sky?",
    "How many days are in a week?",
    "What's the capital of the United States?",
    "Who is the current president?",
    "What's the opposite of hot?",
    "What's the first month of the year?",
    "How many fingers does a human hand typically have?",
    "What's the largest number: 5, 10, or 3?",
    "What animal says 'moo'?",
    "What's the primary color of a banana?",
    "Is water wet?",
    "What's the shape of a soccer ball?",
    "How many legs does a cat have?",
    "What's the main ingredient in bread?",
    "What's the color of grass?",
    "How many hours are in a day?",
    "What's the opposite of up?",
    "What season comes after summer?",
    "What's the sound a dog makes?",
    "How many sides does a triangle have?",
    "What's the largest planet in our solar system?",
    "What's the main color of an apple?",
    "How many wheels does a bicycle have?",
    "What's the fastest way to travel: car, bike, or walking?",
    "What's the main ingredient in a pizza?",
    "What's the opposite of black?",
    "How many letters are in the English alphabet?",
    "What's the name of the planet we live on?",
    "What's the color of the sun?",
    "What's the capital of Japan?",
    "How many legs does an elephant have?",
    "What's the opposite of night?",
    "What's the color of a stop sign?",
    "How many sides does a square have?",
    "What's the main ingredient in a hamburger?",
    "What's the largest ocean on Earth?",
    "How many minutes are in an hour?",
    "What's the opposite of rich?",
    "What's the color of snow?",
    "How many continents are there?",
    "What's the main color of a fire truck?",
    "How many eyes does a human typically have?",
    "What's the opposite of tall?",
    "What's the color of a lemon?",
    "How many days are in a year?",
    "What's the opposite of empty?",
    "What's the main ingredient in an omelet?",
    "How many seasons are there in a year?",
    "What's the opposite of young?",
    "What time is it?",
    "How do I tie my shoes?",
    "Can you name three primary colors?",
    "How many fingers do I have on one hand?",
    "What sound does a cat make?",
    "Is the sun hot or cold?",
    "What's the opposite of big?",
    "What do you use to brush your teeth?",
    "What's the first letter of the alphabet?",
    "Is ice cream hot or cold?",
    "What do you wear on your feet?",
    "What's the opposite of dark?",
    "What do you use to write on paper?",
    "Is a mouse bigger than an elephant?"
  ],
  "simple": [
    "What's the weather like today?",
    "How do I make a sandwich?",
    "What time is it in New York?",
    "Who won the last Super Bowl?",
    "What's the capital of France?",
    "How tall is Mount Everest?",
    "What's the recipe for chocolate chip cookies?",
    "When is the next full moon?",
    "What's the current price of Bitcoin?",
    "How do I change a tire?",
    "What's the population of Tokyo?",
    "How many ounces are in a pound?",
    "What's the boiling point of water?",
    "Who painted the Mona Lisa?",
    "What's the largest planet in our solar system?",
    "How many continents are there?",
    "What's the capital of Australia?",
    "How many legs does a spider have?",
    "What's the main ingredient in guacamole?",
    "Who wrote 'Romeo and Juliet'?",
    "What's the fastest land animal?",
    "How many days are in a leap year?",
    "What's the currency of Japan?",
    "Who invented the telephone?",
    "What's the largest ocean on Earth?",
    "How many teeth does an adult human have?",
    "What's the freezing point of water in Fahrenheit?",
    "Who was the first person to walk on the moon?",
    "What's the national animal of Canada?",
    "How many sides does a hexagon have?",
    "What's the main language spoken in Brazil?",
    "Who painted 'Starry Night'?",
    "What's the capital of Spain?",
    "How do I reset my password?",
    "What's the difference between a virus and a bacteria?",
    "How do I calculate the area of a circle?",
    "What's the recommended daily water intake?",
    "How do I convert Celsius to Fahrenheit?",
    "What's the average lifespan of a dog?",
    "How do I create a strong password?",
    "What's the difference between a fruit and a vegetable?",
    "How do I check my credit score?",
    "What's the proper way to wash hands?",
    "How do I calculate my BMI?",
    "What's the difference between a tornado and a hurricane?",
    "How do I jump-start a car?",
    "What's the difference between a crocodile and an alligator?",
    "How do I remove a stain from clothing?",
    "What's the difference between a lake and a pond?",
    "How do I measure my shoe size?",
    "How do I make a cup of coffee?",
    "What's the capital of England?",
    "How do I change a light bulb?",
    "How do I send an email?",
    "What's the largest mammal on Earth?",
    "How do I set an alarm on my phone?",
    "How do I check my bank balance online?",
    "What's the purpose of a refrigerator?",
    "What's the function of the heart in the human body?",
    "What's the difference between weather and climate?",
    "How do I change the oil in my car?",
    "What's the role of bees in pollination?",
    "How do I read a nutrition label?"
  ],
  "medium": [
    "Explain the basics of photosynthesis",
    "What are the main causes of climate change?",
    "How does a combustion engine work?",
    "Summarize the plot of Romeo and Juliet",
    "What are the key features of a democratic government?",
    "Explain the concept of supply and demand in economics",
    "What are the main differences between Python and JavaScript?",
    "How does the human immune system function?",
    "What were the main causes of World War II?",
    "Describe the process of mitosis in cell division",
    "Explain the concept of natural selection in evolution",
    "How does a nuclear power plant generate electricity?",
    "What are the main components of DNA?",
    "Describe the water cycle and its importance",
    "What are the key principles of cognitive behavioral therapy?",
    "Explain the concept of blockchain technology",
    "How does a refrigerator work?",
    "What are the main features of the U.S. Constitution?",
    "Describe the process of photosynthesis in plants",
    "What are the key differences between socialism and capitalism?",
    "Explain the concept of machine learning in AI",
    "How does the human digestive system work?",
    "What are the main causes of the French Revolution?",
    "Describe the process of plate tectonics",
    "What are the key principles of object-oriented programming?",
    "Explain the concept of moral relativism in philosophy",
    "How does a solar panel convert sunlight into electricity?",
    "What are the main components of the human respiratory system?",
    "Describe the process of cellular respiration",
    "What are the key features of a market economy?",
    "Explain the concept of cognitive dissonance in psychology",
    "How does a jet engine work?",
    "What are the main stages of the scientific method?",
    "Explain the concept of net neutrality and its implications",
    "How does the electoral college system work in the US?",
    "What are the main principles of cognitive computing?",
    "Describe the process of protein synthesis in cells",
    "What are the key components of a blockchain system?",
    "Explain the concept of cultural relativism in anthropology",
    "How does a quantum computer differ from a classical computer?",
    "What are the main theories of personality in psychology?",
    "Describe the process of meiosis in cell division",
    "What are the key principles of sustainable development?",
    "Explain the concept of moral hazard in economics",
    "How does a virtual private network (VPN) work?",
    "What are the main components of the Earth's atmosphere?",
    "Describe the process of DNA replication",
    "What are the key features of a parliamentary system?",
    "Explain the concept of neuroplasticity in neuroscience",
    "How does a 3D printer work?"
  ],
  "complex": [
    "Explain the theory of relativity",
    "Analyze the economic impact of climate change",
    "Discuss the philosophical implications of artificial intelligence",
    "Compare and contrast different approaches to quantum computing",
    "Evaluate the effectiveness of various strategies for reducing global poverty",
    "Analyze the role of epigenetics in human development and disease",
    "Discuss the potential long-term effects of social media on society and human behavior",
    "Explain the concept of dark matter and its importance in cosmology",
    "Analyze the impact of blockchain technology on the future of finance and governance",
    "Discuss the ethical considerations in gene editing technologies like CRISPR",
    "Evaluate the potential consequences of achieving artificial general intelligence",
    "Analyze the geopolitical implications of renewable energy adoption",
    "Discuss the philosophical debate between free will and determinism",
    "Compare different interpretations of quantum mechanics and their implications",
    "Evaluate the long-term sustainability of current economic growth models",
    "Analyze the potential impact of nanotechnology on medicine and materials science",
    "Discuss the ethical implications of human enhancement technologies",
    "Explain the concept of string theory and its potential to unify physics",
    "Analyze the societal impact of increasing automation and AI in the workforce",
    "Discuss the challenges and potential solutions for achieving interplanetary colonization",
    "Evaluate the effectiveness of different approaches to combating systemic racism",
    "Analyze the potential long-term effects of genetic engineering on human evolution",
    "Discuss the philosophical implications of the multiverse theory",
    "Compare different theories of consciousness and their implications for AI",
    "Evaluate the potential impact of quantum cryptography on cybersecurity",
    "Analyze the role of gut microbiota in human health and disease",
    "Discuss the ethical considerations in the development of autonomous weapons systems",
    "Explain the concept of holographic principle in theoretical physics",
    "Analyze the potential impact of synthetic biology on agriculture and medicine",
    "Discuss the challenges and opportunities in developing sustainable urban environments",
    "Evaluate the potential of fusion energy to address global energy needs",
    "Analyze the impact of social media on political polarization and democratic processes",
    "Discuss the ethical implications of brain-computer interfaces and neural implants",
    "Explain the concept of emergence in complex systems and its implications for various fields",
    "Analyze the potential impact of CRISPR gene editing on the future of medicine and agriculture",
    "Discuss the philosophical implications of the simulation hypothesis",
    "Evaluate the potential of quantum machine learning in solving complex computational problems",
    "Analyze the long-term effects of space exploration on human physiology and psychology",
    "Discuss the ethical considerations in the development of human-like artificial intelligence",
    "Explain the concept of topological quantum computing and its potential applications",
    "Analyze the impact of decentralized finance (DeFi) on traditional banking systems",
    "Discuss the potential consequences of geoengineering as a solution to climate change",
    "Evaluate the ethical and practical implications of human life extension technologies",
    "Analyze the potential of synthetic biology in creating novel materials and energy sources",
    "Discuss the philosophical implications of the many-worlds interpretation of quantum mechanics",
    "Explain the concept of quantum entanglement and its potential applications in communication",
    "Analyze the impact of advanced AI on the future of scientific discovery and innovation",
    "Discuss the challenges and potential solutions for achieving global food security",
    "Evaluate the potential of brain-computer interfaces in treating neurological disorders",
    "Analyze the long-term effects of social media on cognitive development and mental health"
  ]
}